Revit 2024 API
BumpMap.BumpmapNormalScale Property
 The property labeled "Amount" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string BumpmapNormalScale { get; }
Visual Basic
Public Shared ReadOnly Property BumpmapNormalScale As String
	Get
Visual C++
public:
static property String^ BumpmapNormalScale {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace